analogdevicesinc/MAX78xxx-RefDes/maxrefdes178-VCAudioPlayback/maxrefdes178_max32666/src/max32666_qspi_master.c
        GPIO_CLR(audio_cs_pin);
        MXC_Delay(MXC_DELAY_USEC(QSPI_CS_ASSERT_WAIT));
        spi_dma(MAX32666_QSPI_DMA_CHANNEL, MAX32666_QSPI, NULL, (uint8_t *) &device_status.statistics.max78000_audio, qspi_packet_header_rx.info.packet_size, MAX32666_QSPI_DMA_REQSEL_SPIRX, NULL);
        spi_dma_wait(MAX32666_QSPI_DMA_CHANNEL, MAX32666_QSPI);
        GPIO_SET(audio_cs_pin);

        PR_DEBUG("audio cnn: %lu", device_status.statistics.max78000_audio.cnn_duration_us);

        break;
    case QSPI_PACKET_TYPE_AUDIO_VERSION_RES:
        if (qspi_packet_header_rx.info.packet_size != sizeof(version_t)) {
            PR_ERROR("Invalid QSPI data len %u", qspi_packet_header_rx.info.packet_size);
            return E_INVALID;
        }

        GPIO_CLR(audio_cs_pin);
        MXC_Delay(MXC_DELAY_USEC(QSPI_CS_ASSERT_WAIT));
        spi_dma(MAX32666_QSPI_DMA_CHANNEL, MAX32666_QSPI, NULL, (uint8_t *) &device_info.device_version.max78000_audio, qspi_packet_header_rx.info.packet_size, MAX32666_QSPI_DMA_REQSEL_SPIRX, NULL);
        spi_dma_wait(MAX32666_QSPI_DMA_CHANNEL, MAX32666_QSPI);
        GPIO_SET(audio_cs_pin);

        PR_INFO("MAX78000 Audio v%d.%d.%d", device_info.device_version.max78000_audio.major, device_info.device_version.max78000_audio.minor, device_info.device_version.max78000_audio.build);

        break;
    case QSPI_PACKET_TYPE_AUDIO_SERIAL_RES:
        if (qspi_packet_header_rx.info.packet_size != sizeof(serial_num_t)) {
            PR_ERROR("Invalid QSPI data len %u", qspi_packet_header_rx.info.packet_size);
            return E_INVALID;
        }

        GPIO_CLR(audio_cs_pin);
        MXC_Delay(MXC_DELAY_USEC(QSPI_CS_ASSERT_WAIT));
        spi_dma(MAX32666_QSPI_DMA_CHANNEL, MAX32666_QSPI, NULL, (uint8_t *) &device_info.device_serial_num.max78000_audio, qspi_packet_header_rx.info.packet_size, MAX32666_QSPI_DMA_REQSEL_SPIRX, NULL);
        spi_dma_wait(MAX32666_QSPI_DMA_CHANNEL, MAX32666_QSPI);
        GPIO_SET(audio_cs_pin);

        PR_INFO("MAX78000 Audio serial: ");
        for (int i = 0; i < sizeof(device_info.device_serial_num.max78000_audio); i++) {
            PR("%02X", device_info.device_serial_num.max78000_audio[i]);
        }
        PR("\n");

        break;
    case QSPI_PACKET_TYPE_AUDIO_BUTTON_PRESS_RES:
        if (qspi_packet_header_rx.info.packet_size != 0) {
            PR_ERROR("Invalid QSPI data len %u", qspi_packet_header_rx.info.packet_size);
            return E_INVALID;
        }

        PR_INFO("Audio button B pressed");
        timestamps.activity_detected = timer_ms_tick;

        break;
    case QSPI_PACKET_TYPE_AUDIO_DATA_REQ:
        break;
    default:
        PR_ERROR("Unknown qspi audio packet");
        return E_INVALID;
        break;
    }

    return E_NO_ERROR;
}

int qspi_master_audio_tx_worker(void)
{
    // Check if waiting TX
    if (qspi_header_buff_audio_tx.packet_type) {
        if (qspi_master_send_audio(qspi_payload_buff_audio_tx, qspi_header_buff_audio_tx.packet_size, qspi_header_buff_audio_tx.packet_type) == E_NO_ERROR) {
            qspi_header_buff_audio_tx.packet_type = 0;
        }
    }

    return E_NO_ERROR;
}

int qspi_master_send_video(uint8_t *data, uint32_t data_size, uint8_t data_type)
{
    qspi_packet_header_t qspi_packet_header_tx = {
            .start_dummy = 0,
            .start_symbol = QSPI_START_SYMBOL,
            .header_crc16 = 0,
            .payload_crc16 = 0,
            .info.packet_size = data_size,
            .info.packet_type = data_type,
            .stop_dummy = 0,
    };

    // Wait LCD dma since it disrupts QSPI write
    spi_dma_wait(MAX32666_LCD_DMA_CHANNEL, MAX32666_LCD_SPI);

    GPIO_CLR(video_rw_pin); // TX request

    qspi_packet_header_tx.header_crc16 = crc16_sw((uint8_t *) &qspi_packet_header_tx.info, sizeof(qspi_packet_header_tx.info));
    if (data_size) {
        qspi_packet_header_tx.payload_crc16 = crc16_sw(data, data_size);
    }

    if (data_size && qspi_video_int_flag) {
        if (qspi_header_buff_video_tx.packet_type && (qspi_header_buff_video_tx.packet_type != data_type)) {
            PR_ERROR("slave wants to send and no tx buffer available, abort %d", data_type);
            return E_BUSY;
        } else if (qspi_header_buff_video_tx.packet_type && (qspi_header_buff_video_tx.packet_type == data_type)) {
            PR_ERROR("slave still wants to send, try again %d", data_type);
            return E_BUSY;
        } else {
            PR_WARN("slave wants to send, save request %d", data_type);
            qspi_header_buff_video_tx.packet_type = data_type;
            qspi_header_buff_video_tx.packet_size = data_size;
            memcpy(qspi_payload_buff_video_tx, data, MIN(sizeof(qspi_payload_buff_video_tx), data_size));
            return E_NO_ERROR;
        }
    }

    GPIO_CLR(video_cs_pin);
    MXC_Delay(MXC_DELAY_USEC(QSPI_CS_ASSERT_WAIT));
    spi_dma(MAX32666_QSPI_DMA_CHANNEL, MAX32666_QSPI, (uint8_t *) &qspi_packet_header_tx, NULL, sizeof(qspi_packet_header_t), MAX32666_QSPI_DMA_REQSEL_SPITX, NULL);
    spi_dma_wait(MAX32666_QSPI_DMA_CHANNEL, MAX32666_QSPI);
    GPIO_SET(video_cs_pin);

    if (data_size) {
        qspi_video_int_flag = 0;
        qspi_master_wait_video_int();
        qspi_video_int_flag = 0;

        GPIO_CLR(video_cs_pin);
        MXC_Delay(MXC_DELAY_USEC(QSPI_CS_ASSERT_WAIT));
        spi_dma(MAX32666_QSPI_DMA_CHANNEL, MAX32666_QSPI, data, NULL, data_size, MAX32666_QSPI_DMA_REQSEL_SPITX, NULL);
        spi_dma_wait(MAX32666_QSPI_DMA_CHANNEL, MAX32666_QSPI);
        GPIO_SET(video_cs_pin);
    }

    return E_NO_ERROR;
}

int qspi_master_send_audio(uint8_t *data, uint32_t data_size, uint8_t data_type)
{
    qspi_packet_header_t qspi_packet_header_tx = {
            .start_dummy = 0,
            .start_symbol = QSPI_START_SYMBOL,
            .header_crc16 = 0,
            .payload_crc16 = 0,
            .info.packet_size = data_size,
            .info.packet_type = data_type,
            .stop_dummy = 0,
    };

    // Wait LCD dma since it disrupts QSPI write
    spi_dma_wait(MAX32666_LCD_DMA_CHANNEL, MAX32666_LCD_SPI);

    GPIO_CLR(audio_rw_pin); // TX request

    qspi_packet_header_tx.header_crc16 = crc16_sw((uint8_t *) &qspi_packet_header_tx.info, sizeof(qspi_packet_header_tx.info));
    if (data_size) {
        qspi_packet_header_tx.payload_crc16 = crc16_sw(data, data_size);
    }

    if (data_size && qspi_audio_int_flag) {
        if (qspi_header_buff_audio_tx.packet_type && (qspi_header_buff_audio_tx.packet_type != data_type)) {
            PR_ERROR("slave wants to send and no tx buffer available, abort %d", data_type);
            return E_BUSY;
        } else if (qspi_header_buff_audio_tx.packet_type && (qspi_header_buff_audio_tx.packet_type == data_type)) {
            PR_ERROR("slave still wants to send, try again %d", data_type);
            return E_BUSY;
        } else {
            PR_WARN("slave wants to send, save request %d", data_type);
            qspi_header_buff_audio_tx.packet_type = data_type;
            qspi_header_buff_audio_tx.packet_size = data_size;
            memcpy(qspi_payload_buff_audio_tx, data, MIN(sizeof(qspi_payload_buff_audio_tx), data_size));
            return E_NO_ERROR;
        }
    }

    GPIO_CLR(audio_cs_pin);
    MXC_Delay(MXC_DELAY_USEC(QSPI_CS_ASSERT_WAIT));
    spi_dma(MAX32666_QSPI_DMA_CHANNEL, MAX32666_QSPI, (uint8_t *) &qspi_packet_header_tx, NULL, sizeof(qspi_packet_header_t), MAX32666_QSPI_DMA_REQSEL_SPITX, NULL);
    spi_dma_wait(MAX32666_QSPI_DMA_CHANNEL, MAX32666_QSPI);
    GPIO_SET(audio_cs_pin);

    if (data_size) {
        qspi_audio_int_flag = 0;
        qspi_master_wait_audio_int();
        qspi_audio_int_flag = 0;

        GPIO_CLR(audio_cs_pin);
        MXC_Delay(MXC_DELAY_USEC(QSPI_CS_ASSERT_WAIT));
        spi_dma(MAX32666_QSPI_DMA_CHANNEL, MAX32666_QSPI, data, NULL, data_size, MAX32666_QSPI_DMA_REQSEL_SPITX, NULL);
        spi_dma_wait(MAX32666_QSPI_DMA_CHANNEL, MAX32666_QSPI);
        GPIO_SET(audio_cs_pin);
    }

    return E_NO_ERROR;
}
